app/views/welcome/_week_table.html.erb

  </tr>
  <% event.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = $1  [["event_id", 3]]