app/controllers/signup_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "asdfasd"]]
---
  def log_in
  	@email = params[:email]
  	@first_name = params[:first_name]
  	puts params
  	@user = User.find_by(email: @email)

INSERT INTO "users" ("first_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "name"], ["email", "va30932@gmail.com"], ["created_at", "2015-09-09 05:41:53.081877"], ["updated_at", "2015-09-09 05:41:53.081877"]]
UPDATE "users" SET "token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["token", "d4452b2cea63bff8991ebedfd2f2a9b8"], ["updated_at", "2015-09-09 06:01:55.971843"], ["id", 4]]
---
  def sign_up
    name = params[:first_name]
    email = params[:email]

    @user = User.create(first_name: name, email: email)
    @user.new_token!
    @user.save

SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT 1  [["token", "36a58f3a35dde6a32d9049ef383f8bda"]]
---
  def log_in_with_token
    token = params[:token]
    @user = User.find_by(token: token)