app/controllers/welcome_controller.rb

	def index
		@user = User.find_by(id: session[:current_user_id])
		puts @user
		if @user
			@events = Event.eventsForCurrentMonth
			@users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users"